{
  "recipes": [
    {
      "title": "Buttermilk Pancakes",
      "chef": "Alice Mishler (Grandma)",
      "prepTime": 50,
      "cookTime": 20,
      "servingSize": 5,
      "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3 tablespoons sugar",
        "2 large eggs, lightly beaten",
        "3 cups buttermilk",
        "3 tablespoon unsalted butter melted, plus 1/2 teaspoon for griddle"
      ],
      "instructions": {
        "stepOne": "Heat griddle to 375. Whisk flour, baking powder, baking soda, salt, and sugar in a bowl. Add eggs, buttermilk, and 4 tablespoons butter; whisk to combine. Batter should have small to medium lumps. Allow batter to rest for 20-30 mins",
        "stepTwo": "Heat oven to 175, to warm pancakes while cooking. Test griddle by sprinkling a few drops of water on it. If water bounces and spatters off griddle, it is not enough. Using a pastry brush, brush remaining 1/2 teaspoon butter or reserved bacon fat onto griddle. Wipe off excess.",
        "stepThree": "Using a 4-oz ladle, about 1/2 cup, pour batter into pools 2 inches apart. When pancakes buddle on top and are slightly dry around edges, about 2-2 1/2 minutes, flip. Cook until golden on bottom, about 1 minute. Repeat with remaining batter; keep finished pancakes on a heat-proof plate in the oven."
      }
    },
    {
      "title": "Maroulosalata",
      "chef": "Olivia Moran",
      "prepTime": 10,
      "cookTime": 0,
      "servingSize": 4,
      "ingredients": [
        "2 romaine hearts",
        "1 cup feta cheese",
        "3/4 cup dill fronds",
        "4 scallions",
        "1/3 cup olive oil",
        "3 tbsp fresh lemon juice",
        "Salt & pepper"
      ],
      "instructions": {
        "stepOne": "Place the lettuce in a large bowl and cover with ice water. Let soak for 15 to 20 minutes to get crisp, then drain. Dry the lettuce either in a salad spinner or using towels, then transfer to a large bowl.",
        "stepTwo": "Add the feta, dill and scallions, and drizzle with olive oil and lemon juice. Season with salt and pepper, toss to combine and serve."
      }
    },
    {
      "title": "Merk's Coffee Cake",
      "chef": "Kim Moran (Mom)",
      "prepTime": 20,
      "cookTime": 50,
      "servingSize": 8,
      "ingredients": [
        "1/2 cup shortening",
        "3/4 cup sugar",
        "1 tablespoon vanilla",
        "3 eggs",
        "2 cups of sifted flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 cup sour cream",
        "6 tablespoons soft butter (for topping)",
        "1 cup firmly packed brown sugar (for topping)",
        "2 teaspoons cinnamon (for topping)",
        "1 cup chopped walnuts (for topping)"
      ],
      "instructions": {
        "stepOne": "Cream together: shortening, sugar, vanilla thoroughly. Add 1 egg at a time to the mixture and beat well.",
        "stepTwo": "Sift the flour, baking powder, and baking soda together. Add the dry ingredients and alternatively add the sour cream to the creamed mixture. Mix well.",
        "stepThree": "Spread half of batter in a 10 inch (removable) tube pan that has been greased and lined on the bottom with wax paper.",
        "stepFour": "Cream butter, brown sugar and cinnamon together. Add the nuts and mix well. Sprinkle half of this mixture over the batter in then add the remaining cake batter. Sprinkle the remaining topping.",
        "stepFive": "Bake at 350 degrees for 50 minutes."
      }
    },
    {
      "title": "Rice Pilaf",
      "chef": "Deralyn Moran (Grandma",
      "prepTime": 10,
      "cookTime": 45,
      "servingSize": 4,
      "ingredients": [
        "2 cups Uncle Ben's long grain white rice",
        "1 cup buglar (grain)",
        "2 cans chicken broth",
        "4 to 5 chicken bullion cubes",
        "1 cup onion",
        "Half box vermicelli",
        "Butter"
      ],
      "instructions": {
        "stepOne": "Butter, onion, take vermicelli, half box, break into small pieces, cook on medium heat until vermicelli is browned. Add rice, bulgar, add broth, about 1 inch above rice line. Add 4-5 bullion cubes.",
        "stepTwo": "Reduce heat to low, simmer for 20-25 minutes."
      }
    },
    {
      "title": "Perfect Keto Meatloaf",
      "chef": "Kevin Moran (Dad)",
      "prepTime": 15,
      "cookTime": 50,
      "servingSize": 8,
      "ingredients": [
        "1 large egg",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 teaspoons garlic powder",
        "2 teaspoons onion powder",
        "1/2 teaspoon dried thyme",
        "2 pounds lean ground beef",
        "1/2 cup almond flour",
        "1/2 cup parmesan- grated",
        "1/4 cup unsweetened ketchup"
      ],
      "instructions": {
        "stepOne": "Preheat your oven to 350°F. Line a rimmed sheet pan with foil.",
        "stepTwo": "In a large bowl, whisk the egg, salt, pepper, garlic powder, onion powder, and thyme.",
        "stepThree": "Add the ground beef, almond flour, and Parmesan. Gently mix, just until uniform.",
        "stepFour": "Shape the mixture into a rectangular loaf by packing it into a plastic wrap-lined small loaf pan (8 X 4 inches).",
        "stepFive": "Transfer it to the prepared baking sheet.",
        "stepSix": "Brush the meatloaf with ketchup.",
        "stepSeven": "Bake the meatloaf until its center registers 160°F, 50-60 minutes.",
        "stepEight": "Rest the meatloaf for 15 minutes before slicing and serving."
      }
    },
    {
      "title": "SPICY NOODS (or Chili Oil Pasta)",
      "chef": "Sophia Moran",
      "prepTime": 15,
      "cookTime": 30,
      "servingSize": 2,
      "ingredients": [
        "1 head of broccoli",
        "1 package of thin sliced chicken breast",
        "Angel hair pasta",
        "5 garlic cloves minced",
        "1/2 tablespoon butter",
        "2 tablespoons chili oil",
        "2 tablespoons soy sauce",
        "2 tablespoons honey",
        "2 tablespoons sweet thai sauce",
        "1/2 cup grated parmesan"
      ],
      "instructions": {
        "stepOne": "Cook broccoli desired (I throw in air fryer - top with desired seasonings).",
        "stepTwo": "Dice chicken breast, then cook desired (I pan fry mine - top with desired seasonings).",
        "stepThree": "Boil your pasta.",
        "stepFour": "For the sauce: combine chili oil, honey, soy sauce, and sweet thai chili and then set aside.",
        "stepFive": "Once angel hair is cooked, drain her and set aside In same pot used to cook pasta, throw in the sauce and let it boil.",
        "stepSix": "Once boiling, turn heat off and throw in pasta.",
        "stepSeven": "Mix all together.",
        "stepEight": "Plate the pasta and top with diced chicken and broccoli. Top with LOTS of parm (like covering whole everything)."
      }
    },
    {
      "title": "Chicken Fajitas",
      "chef": "Lucas Conrad-Loew",
      "prepTime": 10,
      "cookTime": 10,
      "servingSize": 2,
      "ingredients": [
        "2 chicken breasts",
        "Flour tortillas",
        "Three cheese blend",
        "1 lime",
        "Cumin",
        "Paprika",
        "Salt",
        "Pepper",
        "Olive oil"
      ],
      "instructions": {
        "stepOne": "Dice chicken & add olive oil to pan.",
        "stepTwo": "Add chicken to pan, add salt, pepper, cumin, and paprika.",
        "stepThree": "Cook on medium heat for 5-8 minutes.",
        "stepFour": "Remove chicken, leaving any leftover liquid in the pan.",
        "stepFive": "Put tortilla into pan and add cheese. Wait until cheese melts.",
        "stepSix": "Add chicken to torilla and add lime juice.",
        "stepSeven": "Eat!"
      }
    },
    {
      "title": "Mediterranean Shrimp and Couscous",
      "chef": "Callyn Birchmeier",
      "prepTime": 20,
      "cookTime": 20,
      "servingSize": 3,
      "ingredients": [
        "8 oz. Israli couscous",
        "8 oz. shrimp peeled and deveined",
        "1 lemon",
        "Paprika",
        "Oregano",
        "Garlic powder",
        "1/4 cup feta",
        "2 persian cucumbers",
        "1/2 cup cherry tomatoes halved",
        "Olive oil",
        "Fresh mint"
      ],
      "instructions": {
        "stepOne": "Cook 8 oz couscous according to package instructions.",
        "stepTwo": "In a bowl, season shrimp with 1 tablespoon paprika, 1 tablespoon oregano, 1 tablespoon garlic powder, the juice of 1/2 lemon, salt and pepper.",
        "stepThree": "Pan fry shrimp on medium heat for 2 minutes on each side or until shrimp is fully cooked through.",
        "stepFour": "Add shrimp, couscous, cucumber, tomatoes, 3-4 tablespoons fresh mint, and feta to a large mixing bowl.",
        "stepFive": "Drizzle with the juice of 1/2 lemon, 3 tablespoons of olive oil, salt and pepper to taste."
      }
    },
    {
      "title": "Beatty’s Chocolate Cake",
      "chef": "Annie Karsten",
      "prepTime": 20,
      "cookTime": 35,
      "servingSize": 8,
      "ingredients": [
        "1 3/4 cups all-purpose flour",
        "2 cups sugar",
        "3/4 cups good cocoa powder, such as Valrhona",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon kosher salt",
        "1 cup buttermilk, shaken",
        "1/2 cup vegetable oil",
        "2 extra-large eggs, at room temp",
        "1 teaspoon pure vanilla extract",
        "1 cup freshly brewed hot coffee",
        "6 oz. good semisweet chocolate, such as Valrhona (for frosting)",
        "2 sticks unsalted butter, at room temp (for frosting)",
        "1 extra-large egg yolk, at room temp (for frosting)",
        "1 teaspoon pure vanilla extract (for frosting)",
        "1 1/4 cups sifted confectioners' sugar (for frosting)",
        "1 tablespoon instant coffee granules, such as Nescafe (for frosting)"
      ],
      "instructions": {
        "stepOne": "Preheat the oven to 350 degrees. Butter two 8-inch round cake pans. Line with parchment paper, then butter and flour the pans.",
        "stepTwo": "Sift the flour, sugar, cocoa, baking soda, baking powder, and salt into the bowl of an electric mixer fitted with the paddle attachment and mix on low speed until combined. In another bowl, combine the buttermilk, oil, eggs, and vanilla. With the mixer on low speed, slowly add the wet ingredients to the dry ones. With mixer still on low, add the coffee and stir just to combine, scraping the bottom of the bowl with a rubber spatula. Pour the batter evenly into the prepared pans and bake for 35 to 40 minutes, until a cake tester comes out clean. Cool in the pans for 30 minutes, then turn them out onto a cooling rack and cool completely. (Not to worry; the top will sink a little in the center.)",
        "stepThree": "Place one layer, flat side up, on a flat plate or cake pedestal. With a knife or offset spatula, spread a thin layer of buttercream on the top only. Place the second layer on top, flat side up, and spread the frosting evenly first on the sides and then on the top of the cake. Cut in wedges and serve at room temperature.",
        "stepFour": "For the chocolate buttercream frosting, chop the chocolate and place it in a heatproof bowl over a pan over simmering water. Stir until just melted and set aside until cooled to room temperature.",
        "stepFive": "Beat the butter in the bowl of an electric mixer fitted with the paddle attachment on medium-high speed until light yellow and fluffy, about 3 minutes. Add the egg yolk and vanilla and continue beating for 3 minutes. Turn the mixer to low, gradually add the confectioners’ sugar, then beat at medium speed, scraping down the bowl as necessary, until smooth and creamy. Dissolve the coffee in 2 teaspoons of the hottest tap water. On low speed, add the chocolate and coffee to the butter mixture and mix until blended. Don’t whip! Spread immediately on the cooled cake."
      }
    },
    {
      "title": "Spanakopita",
      "chef": "Ashley Sayers",
      "prepTime": 20,
      "cookTime": 35,
      "servingSize": 8,
      "ingredients": [
        "4 packs frozen chopped spinach",
        "1 1/2 lbs. large curd cottage cheese",
        "7 eggs",
        "1/2 cup olive oil",
        "1/4 lb. butter (1 stick)",
        "1 teaspoon dill",
        "1/2 cup parsley",
        "1 bunch green onions (6 or 7)",
        "1 small dry onion",
        "1 lb. feta cheese",
        "1 lb. filo (14 sheets)",
        "Pecorino romano"
      ],
      "instructions": {
        "stepOne": "7 pastry sheets in 9x13 pan, butter between sheets.",
        "stepTwo": "Drain spinach, squeeze dry.",
        "stepThree": "Chop feta. Mix feta, cottage cheese and spinach.",
        "stepFour": "Separate eggs, blend yolks, add oil, onion, parsley, and dill. Pour over spinach.",
        "stepFive": "Fold egg whites into mixture. Put mixture in pan and sprinke pecorino romano on top.",
        "stepSix": "Top with 7 sheets filo brushed with butter. Slice half way down before baking.",
        "stepSeven": "Bake at 350 degrees for 1 hour or longer until brown.",
        "stepEight": "Let cool."
      }
    },
    {
      "title": "The Best Chocolate Chip Cookies",
      "chef": "Habibah Sanusi",
      "prepTime": 15,
      "cookTime": 10,
      "servingSize": 15,
      "ingredients": [
        "3/4 cup unsalted butter",
        "1 cup brown sugar, packed",
        "1/4 cup granulated sugar",
        "1 egg + 1 yolk, room temp",
        "1 tablespoon pure vanilla extract",
        "1 3/4 cup all-purpose flour",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon kosher salt + more flaky sea salt for sprinkling",
        "1 1/2 cups semi sweet chocolate, chopped"
      ],
      "instructions": {
        "stepOne": "Brown the butter over medium heat, stirring constantly until the butter begins to foam and turns a golden brown, emitting a nutty aroma. Make sure you only brown the butter lightly. When butter browns the liquid evaporates off which can dry out your dough. As soon as the butter starts to turn brown and smell nutty, take it off the heat to prevent any more liquid from escaping.  Take butter off the heat and allow to cool.",
        "stepTwo": "In a large mixing bowl combine the cooled brown butter, brown sugar, and white sugar. Beat until mixed together. Add in the egg, egg yolk, and vanilla extract. Mix well.",
        "stepThree": "In separate bowl mix together the flour, salt and baking soda. Mix half the dry ingredients into the wet until everything comes together. Slowly add in the remaining flour a little bit at a time, stopping if the dough starts to get too dry. Fold in the chocolate. Do not over mix.",
        "stepFour": "Refrigerate the cookie dough for at least a half hour, or overnight.",
        "stepFive": "When you are ready to bake the cookies, preheat the oven to 350°F and line a cookie sheet with parchment paper. Use a 1.5  or 2 ounce cookie scoop to scoop the cookie dough out into balls, placing them 2 inches apart on the prepared sheet. Bake for 11 minutes*, or until the edges are just golden brown and the centers have puffed up but are still gooey.",
        "stepSix": "Allow to cool before eating!"
      }
    },
    {
      "title": "Homemade Vegan Lasagna",
      "chef": "Lisa Reynolds",
      "prepTime": 20,
      "cookTime": 40,
      "servingSize": 5,
      "ingredients": [
        "1-2 package of lasagna noodles",
        "2 jars marinara sauce",
        "2 tablespoons water",
        "Vegan parmesan for topping",
        "1 16 oz. package firm tofu",
        "3 tablespoons nutritional yeast",
        "1/2 cup fresh basil",
        "1 tablespoon dried oregano",
        "2 lemons juiced",
        "1/2 teaspoon salt"
      ],
      "instructions": {
        "stepOne": "Preheat oven to 375 degrees.",
        "stepTwo": "Prepare the tofu ricotta by tofu, nutritional yeast, fresh basil, oregano, lemons, and salt into the food processor. Blend until creamy and well combined.",
        "stepThree": "Prep the bottom of a baking dish (9x12 will work) by adding about 1/2 cup marinara sauce to the bottom of the pan and 2 tbsp water. Spread it around evenly.",
        "stepFour": "Add a layer of 4 lasagna noodles (or however many you can fit). Next, add about 2 tbsp of ricotta cheese to each noodle. Add some marinara sauce and spread around - be generous. Add another layer of pasta and repeat this process until you run out of ricotta cheese.",
        "stepFive": "Top with vegan parmesan and cover with foil. Bake for 40 minutes covered and 15 minutes uncovered.",
        "stepSix": "Serve and enjoy!"
      }
    },
    {
      "title": "Instant Pot Shredded Chicken Tacos",
      "chef": "Nick Clark & Dakota Selmi",
      "prepTime": 15,
      "cookTime": 45,
      "servingSize": 5,
      "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "2 pounds boneless, skinless chicken breasts",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 small yellow onion",
        "4 cloves garlic",
        "2 teaspoons chili powder",
        "3 chipotle peppers in adobo",
        "1 can diced tomatoes in their juices (14 oz.)",
        "1/4 cup freshly squeezed lime juice",
        "1 ripe avocado (for avocado sauce)",
        "3/4 cup nonfat plain Greek yogurt (for avocado sauce)",
        "2-4 tablespoons fresh lime juice (for avocado sauce)",
        "1/4 teaspoon kosher salt (for avocado sauce)",
        "Tortilla or taco shell of your choice"
      ],
      "instructions": {
        "stepOne": "Season both sides of the chicken with 1 teaspoon kosher salt and black pepper.",
        "stepTwo": "Set the Instant Pot to sauté. Heat 1/2 tablespoon of the olive oil. Once hot and shimmering, add half the chicken and sear both sides for 2 to 3 minutes each, just until brown (the chicken does not need to be cooked through). Do not disturb the chicken while each side sears.  Remove to a plate and set aside. Add the second half of the chicken and sear each side for 2 to 3 minutes each. Remove to the same plate.",
        "stepThree": "With the Instant Pot still on sauté, add the remaining 1/2 tablespoon olive oil. Add the onion, garlic, chili powder, and remaining 1/2 teaspoon kosher salt. Let cook 3 minutes, until the onion beings to soften. Turn the Instant Pot off (on my model, I hit CANCEL). Stir in the chipotle peppers, tomatoes, and reserved chicken. Arrange the chicken pieces in a single layer (a little overlap is OK, and the chicken will be touching). Pour the lime juice over the top.",
        "stepFour": "Lock the lid in place. Cook on manual pressure for 8 minutes. As soon as the time is up, vent immediately. Once you can open the lid, turn the Instant Pot off, and then remove the chicken to a large bowl or plate. Turn the Instant Pot to SAUTE. Bring the cooking liquid to a simmer. Let simmer for 5 to 10 minutes, stirring occasionally, until the liquid reduces by about half. Meanwhile, shred the chicken with two forks (or, once it is cool enough, your fingers).",
        "stepFive": "Once the liquid is reduced, turn the Instant Pot off, return the chicken into the Instant Pot, and then stir the chicken to coat in the sauce.",
        "stepSix": "Prepare the avocado sauce (I like to do this while the chicken is pressure cooking): In a food processor, blend together the avocado, Greek yogurt, 2 tablespoons lime juice, and salt until smooth. Taste and add additional salt or lime juice as desired.",
        "stepSeven": "To serve: Fill the shells or tortillas with the chicken, drizzle with avocado sauce, and add any desired toppings. Enjoy immediately."
      }
    },
    {
      "title": "Instant Pot Shredded Chicken Tacos",
      "chef": "Nick Clark & Dakota Selmi",
      "prepTime": 15,
      "cookTime": 45,
      "servingSize": 5,
      "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "2 pounds boneless, skinless chicken breasts",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 small yellow onion",
        "4 cloves garlic",
        "2 teaspoons chili powder",
        "3 chipotle peppers in adobo",
        "1 can diced tomatoes in their juices (14 oz.)",
        "1/4 cup freshly squeezed lime juice",
        "1 ripe avocado (for avocado sauce)",
        "3/4 cup nonfat plain Greek yogurt (for avocado sauce)",
        "2-4 tablespoons fresh lime juice (for avocado sauce)",
        "1/4 teaspoon kosher salt (for avocado sauce)",
        "Tortilla or taco shell of your choice"
      ],
      "instructions": {
        "stepOne": "Season both sides of the chicken with 1 teaspoon kosher salt and black pepper.",
        "stepTwo": "Set the Instant Pot to sauté. Heat 1/2 tablespoon of the olive oil. Once hot and shimmering, add half the chicken and sear both sides for 2 to 3 minutes each, just until brown (the chicken does not need to be cooked through). Do not disturb the chicken while each side sears.  Remove to a plate and set aside. Add the second half of the chicken and sear each side for 2 to 3 minutes each. Remove to the same plate.",
        "stepThree": "With the Instant Pot still on sauté, add the remaining 1/2 tablespoon olive oil. Add the onion, garlic, chili powder, and remaining 1/2 teaspoon kosher salt. Let cook 3 minutes, until the onion beings to soften. Turn the Instant Pot off (on my model, I hit CANCEL). Stir in the chipotle peppers, tomatoes, and reserved chicken. Arrange the chicken pieces in a single layer (a little overlap is OK, and the chicken will be touching). Pour the lime juice over the top.",
        "stepFour": "Lock the lid in place. Cook on manual pressure for 8 minutes. As soon as the time is up, vent immediately. Once you can open the lid, turn the Instant Pot off, and then remove the chicken to a large bowl or plate. Turn the Instant Pot to SAUTE. Bring the cooking liquid to a simmer. Let simmer for 5 to 10 minutes, stirring occasionally, until the liquid reduces by about half. Meanwhile, shred the chicken with two forks (or, once it is cool enough, your fingers).",
        "stepFive": "Once the liquid is reduced, turn the Instant Pot off, return the chicken into the Instant Pot, and then stir the chicken to coat in the sauce.",
        "stepSix": "Prepare the avocado sauce (I like to do this while the chicken is pressure cooking): In a food processor, blend together the avocado, Greek yogurt, 2 tablespoons lime juice, and salt until smooth. Taste and add additional salt or lime juice as desired.",
        "stepSeven": "To serve: Fill the shells or tortillas with the chicken, drizzle with avocado sauce, and add any desired toppings. Enjoy immediately."
      }
    }
  ]
}
