{
  "recipes": [
    {
      "title": "Buttermilk Pancakes",
      "chef": "Alice Mishler (Grandma)",
      "prepTime": 50,
      "cookTime": 20,
      "servingSize": 5,
      "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3 tablespoons sugar",
        "2 large eggs, lightly beaten",
        "3 cups buttermilk",
        "3 tablespoon unsalted butter melted, plus 1/2 teaspoon for griddle"
      ],
      "instructions": {
        "stepOne": "Heat griddle to 375. Whisk flour, baking powder, baking soda, salt, and sugar in a bowl. Add eggs, buttermilk, and 4 tablespoons butter; whisk to combine. Batter should have small to medium lumps. Allow batter to rest for 20-30 mins",
        "stepTwo": "Heat oven to 175, to warm pancakes while cooking. Test griddle by sprinkling a few drops of water on it. If water bounces and spatters off griddle, it is not enough. Using a pastry brush, brush remaining 1/2 teaspoon butter or reserved bacon fat onto griddle. Wipe off excess.",
        "stepThree": "Using a 4-oz ladle, about 1/2 cup, pour batter into pools 2 inches apart. When pancakes buddle on top and are slightly dry around edges, about 2-2 1/2 minutes, flip. Cook until golden on bottom, about 1 minute. Repeat with remaining batter; keep finished pancakes on a heat-proof plate in the oven."
      }
    },
    {
      "title": "Maroulosalata",
      "chef": "Olivia Moran",
      "prepTime": 10,
      "cookTime": 0,
      "servingSize": 4,
      "ingredients": [
        "2 romaine hearts",
        "1 cup feta cheese",
        "3/4 cup dill fronds",
        "4 scallions",
        "1/3 cup olive oil",
        "3 tbsp fresh lemon juice",
        "Salt & pepper"
      ],
      "instructions": {
        "stepOne": "Place the lettuce in a large bowl and cover with ice water. Let soak for 15 to 20 minutes to get crisp, then drain. Dry the lettuce either in a salad spinner or using towels, then transfer to a large bowl.",
        "stepTwo": "Add the feta, dill and scallions, and drizzle with olive oil and lemon juice. Season with salt and pepper, toss to combine and serve."
      }
    },
    {
      "title": "Merk's Coffee Cake",
      "chef": "Kim Moran (Mom)",
      "prepTime": 20,
      "cookTime": 50,
      "servingSize": 8,
      "ingredients": [
        "1/2 cup shortening",
        "3/4 cup sugar",
        "1 tablespoon vanilla",
        "3 eggs",
        "2 cups of sifted flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 cup sour cream",
        "6 tablespoons soft butter (for topping)",
        "1 cup firmly packed brown sugar (for topping)",
        "2 teaspoons cinnamon (for topping)",
        "1 cup chopped walnuts (for topping)"
      ],
      "instructions": {
        "stepOne": "Cream together: shortening, sugar, vanilla thoroughly. Add 1 egg at a time to the mixture and beat well.",
        "stepTwo": "Sift the flour, baking powder, and baking soda together. Add the dry ingredients and alternatively add the sour cream to the creamed mixture. Mix well.",
        "stepThree": "Spread half of batter in a 10 inch (removable) tube pan that has been greased and lined on the bottom with wax paper.",
        "stepFour": "Cream butter, brown sugar and cinnamon together. Add the nuts and mix well. Sprinkle half of this mixture over the batter in then add the remaining cake batter. Sprinkle the remaining topping.",
        "stepFive": "Bake at 350 degrees for 50 minutes."
      }
    },
    {
      "title": "Rice Pilaf",
      "chef": "Deralyn Moran (Grandma",
      "prepTime": 10,
      "cookTime": 45,
      "servingSize": 4,
      "ingredients": [
        "2 cups Uncle Ben's long grain white rice",
        "1 cup buglar (grain)",
        "2 cans chicken broth",
        "4 to 5 chicken bullion cubes",
        "1 cup onion",
        "Half box vermicelli",
        "Butter"
      ],
      "instructions": {
        "stepOne": "Butter, onion, take vermicelli, half box, break into small pieces, cook on medium heat until vermicelli is browned. Add rice, bulgar, add broth, about 1 inch above rice line. Add 4-5 bullion cubes.",
        "stepTwo": "Reduce heat to low, simmer for 20-25 minutes."
      }
    },
    {
      "title": "Perfect Keto Meatloaf",
      "chef": "Kevin Moran (Dad)",
      "prepTime": 15,
      "cookTime": 50,
      "servingSize": 8,
      "ingredients": [
        "1 large egg",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 teaspoons garlic powder",
        "2 teaspoons onion powder",
        "1/2 teaspoon dried thyme",
        "2 pounds lean ground beef",
        "1/2 cup almond flour",
        "1/2 cup parmesan- grated",
        "1/4 cup unsweetened ketchup"
      ],
      "instructions": {
        "stepOne": "Preheat your oven to 350°F. Line a rimmed sheet pan with foil.",
        "stepTwo": "In a large bowl, whisk the egg, salt, pepper, garlic powder, onion powder, and thyme.",
        "stepThree": "Add the ground beef, almond flour, and Parmesan. Gently mix, just until uniform.",
        "stepFour": "Shape the mixture into a rectangular loaf by packing it into a plastic wrap-lined small loaf pan (8 X 4 inches).",
        "stepFive": "Transfer it to the prepared baking sheet.",
        "stepSix": "Brush the meatloaf with ketchup.",
        "stepSeven": "Bake the meatloaf until its center registers 160°F, 50-60 minutes.",
        "stepEight": "Rest the meatloaf for 15 minutes before slicing and serving."
      }
    },
    {
      "title": "SPICY NOODS (or Chili Oil Pasta)",
      "chef": "Sophia Moran",
      "prepTime": 15,
      "cookTime": 30,
      "servingSize": 2,
      "ingredients": [
        "1 head of broccoli",
        "1 package of thin sliced chicken breast",
        "Angel hair pasta",
        "5 garlic cloves minced",
        "1/2 tablespoon butter",
        "2 tablespoons chili oil",
        "2 tablespoons soy sauce",
        "2 tablespoons honey",
        "2 tablespoons sweet thai sauce",
        "1/2 cup grated parmesan"
      ],
      "instructions": {
        "stepOne": "Cook broccoli desired (I throw in air fryer - top with desired seasonings).",
        "stepTwo": "Dice chicken breast, then cook desired (I pan fry mine - top with desired seasonings).",
        "stepThree": "Boil your pasta.",
        "stepFour": "For the sauce: combine chili oil, honey, soy sauce, and sweet thai chili and then set aside.",
        "stepFive": "Once angel hair is cooked, drain her and set aside In same pot used to cook pasta, throw in the sauce and let it boil.",
        "stepSix": "Once boiling, turn heat off and throw in pasta.",
        "stepSeven": "Mix all together.",
        "stepEight": "Plate the pasta and top with diced chicken and broccoli. Top with LOTS of parm (like covering whole everything)."
      }
    },
    {
      "title": "Chicken Fajitas",
      "chef": "Lucas Conrad-Loew",
      "prepTime": 10,
      "cookTime": 10,
      "servingSize": 2,
      "ingredients": [
        "2 chicken breasts",
        "Flour tortillas",
        "Three cheese blend",
        "1 lime",
        "Cumin",
        "Paprika",
        "Salt",
        "Pepper",
        "Olive oil"
      ],
      "instructions": {
        "stepOne": "Dice chicken & add olive oil to pan.",
        "stepTwo": "Add chicken to pan, add salt, pepper, cumin, and paprika.",
        "stepThree": "Cook on medium heat for 5-8 minutes.",
        "stepFour": "Remove chicken, leaving any leftover liquid in the pan.",
        "stepFive": "Put tortilla into pan and add cheese. Wait until cheese melts.",
        "stepSix": "Add chicken to tortilla and add lime juice.",
        "stepSeven": "Eat!"
      }
    },
    {
      "title": "Mediterranean Shrimp and Couscous",
      "chef": "Callyn Birchmeier",
      "prepTime": 20,
      "cookTime": 20,
      "servingSize": 3,
      "ingredients": [
        "8 oz. Israeli couscous",
        "8 oz. shrimp peeled and deveined",
        "1 lemon",
        "Paprika",
        "Oregano",
        "Garlic powder",
        "1/4 cup feta",
        "2 persian cucumbers",
        "1/2 cup cherry tomatoes halved",
        "Olive oil",
        "Fresh mint"
      ],
      "instructions": {
        "stepOne": "Cook 8 oz couscous according to package instructions.",
        "stepTwo": "In a bowl, season shrimp with 1 tablespoon paprika, 1 tablespoon oregano, 1 tablespoon garlic powder, the juice of 1/2 lemon, salt and pepper.",
        "stepThree": "Pan fry shrimp on medium heat for 2 minutes on each side or until shrimp is fully cooked through.",
        "stepFour": "Add shrimp, couscous, cucumber, tomatoes, 3-4 tablespoons fresh mint, and feta to a large mixing bowl.",
        "stepFive": "Drizzle with the juice of 1/2 lemon, 3 tablespoons of olive oil, salt and pepper to taste."
      }
    },
    {
      "title": "Beatty’s Chocolate Cake",
      "chef": "Annie Karsten",
      "prepTime": 20,
      "cookTime": 35,
      "servingSize": 8,
      "ingredients": [
        "1 3/4 cups all-purpose flour",
        "2 cups sugar",
        "3/4 cups good cocoa powder, such as Valrhona",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1 teaspoon kosher salt",
        "1 cup buttermilk, shaken",
        "1/2 cup vegetable oil",
        "2 extra-large eggs, at room temp",
        "1 teaspoon pure vanilla extract",
        "1 cup freshly brewed hot coffee",
        "6 oz. good semisweet chocolate, such as Valrhona (for frosting)",
        "2 sticks unsalted butter, at room temp (for frosting)",
        "1 extra-large egg yolk, at room temp (for frosting)",
        "1 teaspoon pure vanilla extract (for frosting)",
        "1 1/4 cups sifted confectioners' sugar (for frosting)",
        "1 tablespoon instant coffee granules, such as Nescafe (for frosting)"
      ],
      "instructions": {
        "stepOne": "Preheat the oven to 350 degrees. Butter two 8-inch round cake pans. Line with parchment paper, then butter and flour the pans.",
        "stepTwo": "Sift the flour, sugar, cocoa, baking soda, baking powder, and salt into the bowl of an electric mixer fitted with the paddle attachment and mix on low speed until combined. In another bowl, combine the buttermilk, oil, eggs, and vanilla. With the mixer on low speed, slowly add the wet ingredients to the dry ones. With mixer still on low, add the coffee and stir just to combine, scraping the bottom of the bowl with a rubber spatula. Pour the batter evenly into the prepared pans and bake for 35 to 40 minutes, until a cake tester comes out clean. Cool in the pans for 30 minutes, then turn them out onto a cooling rack and cool completely. (Not to worry; the top will sink a little in the center.)",
        "stepThree": "Place one layer, flat side up, on a flat plate or cake pedestal. With a knife or offset spatula, spread a thin layer of buttercream on the top only. Place the second layer on top, flat side up, and spread the frosting evenly first on the sides and then on the top of the cake. Cut in wedges and serve at room temperature.",
        "stepFour": "For the chocolate buttercream frosting, chop the chocolate and place it in a heatproof bowl over a pan over simmering water. Stir until just melted and set aside until cooled to room temperature.",
        "stepFive": "Beat the butter in the bowl of an electric mixer fitted with the paddle attachment on medium-high speed until light yellow and fluffy, about 3 minutes. Add the egg yolk and vanilla and continue beating for 3 minutes. Turn the mixer to low, gradually add the confectioners’ sugar, then beat at medium speed, scraping down the bowl as necessary, until smooth and creamy. Dissolve the coffee in 2 teaspoons of the hottest tap water. On low speed, add the chocolate and coffee to the butter mixture and mix until blended. Don’t whip! Spread immediately on the cooled cake."
      }
    },
    {
      "title": "Spanakopita",
      "chef": "Ashley Sayers",
      "prepTime": 20,
      "cookTime": 35,
      "servingSize": 8,
      "ingredients": [
        "4 packs frozen chopped spinach",
        "1 1/2 lbs. large curd cottage cheese",
        "7 eggs",
        "1/2 cup olive oil",
        "1/4 lb. butter (1 stick)",
        "1 teaspoon dill",
        "1/2 cup parsley",
        "1 bunch green onions (6 or 7)",
        "1 small dry onion",
        "1 lb. feta cheese",
        "1 lb. filo (14 sheets)",
        "Pecorino romano"
      ],
      "instructions": {
        "stepOne": "7 pastry sheets in 9x13 pan, butter between sheets.",
        "stepTwo": "Drain spinach, squeeze dry.",
        "stepThree": "Chop feta. Mix feta, cottage cheese and spinach.",
        "stepFour": "Separate eggs, blend yolks, add oil, onion, parsley, and dill. Pour over spinach.",
        "stepFive": "Fold egg whites into mixture. Put mixture in pan and sprinkle pecorino romano on top.",
        "stepSix": "Top with 7 sheets filo brushed with butter. Slice half way down before baking.",
        "stepSeven": "Bake at 350 degrees for 1 hour or longer until brown.",
        "stepEight": "Let cool."
      }
    },
    {
      "title": "The Best Chocolate Chip Cookies",
      "chef": "Habibah Sanusi",
      "prepTime": 15,
      "cookTime": 10,
      "servingSize": 15,
      "ingredients": [
        "3/4 cup unsalted butter",
        "1 cup brown sugar, packed",
        "1/4 cup granulated sugar",
        "1 egg + 1 yolk, room temp",
        "1 tablespoon pure vanilla extract",
        "1 3/4 cup all-purpose flour",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon kosher salt + more flaky sea salt for sprinkling",
        "1 1/2 cups semi sweet chocolate, chopped"
      ],
      "instructions": {
        "stepOne": "Brown the butter over medium heat, stirring constantly until the butter begins to foam and turns a golden brown, emitting a nutty aroma. Make sure you only brown the butter lightly. When butter browns the liquid evaporates off which can dry out your dough. As soon as the butter starts to turn brown and smell nutty, take it off the heat to prevent any more liquid from escaping.  Take butter off the heat and allow to cool.",
        "stepTwo": "In a large mixing bowl combine the cooled brown butter, brown sugar, and white sugar. Beat until mixed together. Add in the egg, egg yolk, and vanilla extract. Mix well.",
        "stepThree": "In separate bowl mix together the flour, salt and baking soda. Mix half the dry ingredients into the wet until everything comes together. Slowly add in the remaining flour a little bit at a time, stopping if the dough starts to get too dry. Fold in the chocolate. Do not over mix.",
        "stepFour": "Refrigerate the cookie dough for at least a half hour, or overnight.",
        "stepFive": "When you are ready to bake the cookies, preheat the oven to 350°F and line a cookie sheet with parchment paper. Use a 1.5  or 2 ounce cookie scoop to scoop the cookie dough out into balls, placing them 2 inches apart on the prepared sheet. Bake for 11 minutes*, or until the edges are just golden brown and the centers have puffed up but are still gooey.",
        "stepSix": "Allow to cool before eating!"
      }
    },
    {
      "title": "Homemade Vegan Lasagna",
      "chef": "Lisa Reynolds",
      "prepTime": 20,
      "cookTime": 40,
      "servingSize": 5,
      "ingredients": [
        "1-2 package of lasagna noodles",
        "2 jars marinara sauce",
        "2 tablespoons water",
        "Vegan parmesan for topping",
        "1 16 oz. package firm tofu",
        "3 tablespoons nutritional yeast",
        "1/2 cup fresh basil",
        "1 tablespoon dried oregano",
        "2 lemons juiced",
        "1/2 teaspoon salt"
      ],
      "instructions": {
        "stepOne": "Preheat oven to 375 degrees.",
        "stepTwo": "Prepare the tofu ricotta by tofu, nutritional yeast, fresh basil, oregano, lemons, and salt into the food processor. Blend until creamy and well combined.",
        "stepThree": "Prep the bottom of a baking dish (9x12 will work) by adding about 1/2 cup marinara sauce to the bottom of the pan and 2 tbsp water. Spread it around evenly.",
        "stepFour": "Add a layer of 4 lasagna noodles (or however many you can fit). Next, add about 2 tbsp of ricotta cheese to each noodle. Add some marinara sauce and spread around - be generous. Add another layer of pasta and repeat this process until you run out of ricotta cheese.",
        "stepFive": "Top with vegan parmesan and cover with foil. Bake for 40 minutes covered and 15 minutes uncovered.",
        "stepSix": "Serve and enjoy!"
      }
    },
    {
      "title": "Instant Pot Shredded Chicken Tacos",
      "chef": "Nick Clark & Dakota Selmi",
      "prepTime": 15,
      "cookTime": 45,
      "servingSize": 5,
      "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "2 pounds boneless, skinless chicken breasts",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 small yellow onion",
        "4 cloves garlic",
        "2 teaspoons chili powder",
        "3 chipotle peppers in adobo",
        "1 can diced tomatoes in their juices (14 oz.)",
        "1/4 cup freshly squeezed lime juice",
        "1 ripe avocado (for avocado sauce)",
        "3/4 cup nonfat plain Greek yogurt (for avocado sauce)",
        "2-4 tablespoons fresh lime juice (for avocado sauce)",
        "1/4 teaspoon kosher salt (for avocado sauce)",
        "Tortilla or taco shell of your choice"
      ],
      "instructions": {
        "stepOne": "Season both sides of the chicken with 1 teaspoon kosher salt and black pepper.",
        "stepTwo": "Set the Instant Pot to sauté. Heat 1/2 tablespoon of the olive oil. Once hot and shimmering, add half the chicken and sear both sides for 2 to 3 minutes each, just until brown (the chicken does not need to be cooked through). Do not disturb the chicken while each side sears.  Remove to a plate and set aside. Add the second half of the chicken and sear each side for 2 to 3 minutes each. Remove to the same plate.",
        "stepThree": "With the Instant Pot still on sauté, add the remaining 1/2 tablespoon olive oil. Add the onion, garlic, chili powder, and remaining 1/2 teaspoon kosher salt. Let cook 3 minutes, until the onion beings to soften. Turn the Instant Pot off (on my model, I hit CANCEL). Stir in the chipotle peppers, tomatoes, and reserved chicken. Arrange the chicken pieces in a single layer (a little overlap is OK, and the chicken will be touching). Pour the lime juice over the top.",
        "stepFour": "Lock the lid in place. Cook on manual pressure for 8 minutes. As soon as the time is up, vent immediately. Once you can open the lid, turn the Instant Pot off, and then remove the chicken to a large bowl or plate. Turn the Instant Pot to SAUTE. Bring the cooking liquid to a simmer. Let simmer for 5 to 10 minutes, stirring occasionally, until the liquid reduces by about half. Meanwhile, shred the chicken with two forks (or, once it is cool enough, your fingers).",
        "stepFive": "Once the liquid is reduced, turn the Instant Pot off, return the chicken into the Instant Pot, and then stir the chicken to coat in the sauce.",
        "stepSix": "Prepare the avocado sauce (I like to do this while the chicken is pressure cooking): In a food processor, blend together the avocado, Greek yogurt, 2 tablespoons lime juice, and salt until smooth. Taste and add additional salt or lime juice as desired.",
        "stepSeven": "To serve: Fill the shells or tortillas with the chicken, drizzle with avocado sauce, and add any desired toppings. Enjoy immediately."
      }
    },
    {
      "title": "Nashville Hot Chicken Sandwich",
      "chef": "Ciara Flynn",
      "prepTime": 20,
      "cookTime": 40,
      "servingSize": 4,
      "ingredients": [
        "4 potato buns",
        "1/4 cup cole slaw",
        "16 pickle chips",
        "4 boneless, skinless chicken thighs",
        "2 cups all purpose flour (flour mixture)",
        "1 tablespoon garlic salt (flour mixture)",
        "1 tablespoon paprika (flour mixture)",
        "1/2 tablespoon cayenne pepper (flour mixture)",
        "1/2 teaspoon pepper (flour mixture)",
        "2 eggs (egg mixture)",
        "1 cup buttermilk (egg mixture)",
        "2 tablespoon hot sauce (egg mixture)",
        "1 tablespoon cayenne pepper (spicy oil mixture)",
        "1 tablespoon garlic powder (spicy oil mixture)",
        "1 tablespoon paprika (spicy oil mixture)",
        "1/2 tablespoon chili powder (spicy oil mixture)",
        "1/2 tablespoon salt (spicy oil mixture)",
        "1 teaspoon black pepper (spicy oil mixture)",
        "2 tablespoon light brown sugar (spicy oil mixture)",
        "1 cup frying oil"
      ],
      "instructions": {
        "stepOne": "Salt and pepper your thighs and refrigerate for 30 mins.",
        "stepTwo": "Dredge your boneless thighs in your egg mixture, then your flour mixture and repeat once more.",
        "stepThree": "Fry for 10 minutes (or until golden brown). Set aside to dry.",
        "stepFour": "Make your spicy oil using 1 cup of hot oil. Coat each piece of fried chicken in your spicy oil.",
        "stepFive": "Toast your buns and add one piece of chicken, 4 pickle, and a scoop of cole slaw."
      }
    },
    {
      "title": "Homemade Vodka Pasta",
      "chef": "Izzy McMullen",
      "prepTime": 10,
      "cookTime": 20,
      "servingSize": 2,
      "ingredients": [
        "1 box of pasta (penne or rigatoni)",
        "Olive oil",
        "Salt & pepper",
        "Garlic salt",
        "1 stick of butter",
        "1 small carton of heavy whipping cream",
        "1 lemon",
        "1 small can of tomato paste",
        "3-4 cloves of minced garlic",
        "Add chopped red onion if you'd like",
        "Shredded or chunk mozzarella",
        "Basil"
      ],
      "instructions": {
        "stepOne": "Before you start the sauce boil water w dash of salt.",
        "stepTwo": "Take a pan and add a swirl of olive oil with minced garlic and onion - heat until garlic almost turns brown.",
        "stepThree": "Add in full can of tomato paste and mix.",
        "stepFour": "Pour in 3/4 of the heavy whipping cream. Mix until it bubbles.",
        "stepFive": "Squeeze half a lemon and a few chunks of butter.",
        "stepSix": "My sister adds shredded mozzarella in there but I do on top.",
        "stepSeven": "Add in the rest of heavy whipping cream & more butter if you would like more creamy.",
        "stepEight": "KEEP SOME OF BOILED WATER BEFORE YOU DRAIN!!! It helps the noodles stick to sauce. I use a coffee mug and fill 1/4 of way and pour right into sauce before noodles.",
        "stepNine": "Drain noodles and mix! Top with mozzarella chunks and Basil."
      }
    },
    {
      "title": "Taco Pie",
      "chef": "Audra Healey",
      "prepTime": 10,
      "cookTime": 20,
      "servingSize": 5,
      "ingredients": [
        "1 tube Pillsbury crescent dough",
        "1 lb. lean ground beef",
        "1 packet taco season mix",
        "1 cup shredded cheese",
        "Sour cream",
        "1/4 cup onions",
        "1/4 cup olives",
        "Doritos",
        "Shredded lettuce for topping",
        "Chopped tomatoes for topping",
        "Taco sauce for topping"
      ],
      "instructions": {
        "stepOne": "Brown 1 lb. lean beef in pan. Use 1/2 taco seasoning packet and 1/3 - 1/2 of suggested water. Drain any grease (if you want additional flavor add onion and chopped olives and cook with the beef).",
        "stepTwo": "Using crescent roll dough, line a pie pan (glass or metal is fine) creating a pie crust.",
        "stepThree": "Crush enough Doritos to line the bottom of the pie crust. This helps create a moisture barrier so that your crust cooks and doesn't get soggy.",
        "stepFour": "Add cooked beef mixture.",
        "stepFive": "On top of beef mixture, spread a fine layer of sour cream (avoiding edges of crust).",
        "stepSix": "Sprinkle a cup (or more if desired) of shredded cheese on top of sour cream.",
        "stepSeven": "Cook at 375 degrees for 11-13 minutes. Last 5 minutes add crushed Doritos to the top layer."
      }
    },
    {
      "title": "Spinny Feta Scramble",
      "chef": "Natalie Peterson",
      "prepTime": 4,
      "cookTime": 15,
      "servingSize": 1,
      "ingredients": [
        "Frozen hash brown or piece of toast",
        "2 eggs",
        "1 tablespoon feta",
        "Handful of spinach",
        "Butter",
        "Salt & pepper"
      ],
      "instructions": {
        "stepOne": "I always enjoy a hash brown with this recipe, so to start I begin by throwing my hash brown patty into the air fryer for about 12 minutes.",
        "stepTwo": "Next I pull out the butter, eggs, spinach, and feta.",
        "stepThree": "Crack and whisk two eggs together in a small bowl to scramble, add salt and pepper In a small pan melt the butter down and throw a handful of spinach in to sauté.",
        "stepFour": "Just as the spinach is welting down, add in the feta cheese, let melt for about 20 seconds and then add whisked eggs.",
        "stepFive": "Lastly scramble the spinach and feta into the eggs, serve overtop your hash brown or buttered toast and enjoy!"
      }
    },
    {
      "title": "Carrot Cake",
      "chef": "Elliot Whitney",
      "prepTime": 50,
      "cookTime": 40,
      "servingSize": 10,
      "ingredients": [
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons baking soda",
        "2 teaspoons ground cinnamon",
        "3/4 teaspoon salt",
        "3 cups grated carrots (you can grate the carrots in a food processor fitted with a shredding blade)",
        "1 cup coarsely chopped walnuts or pecans",
        "1 cup shredded coconut, sweetened or unsweetened",
        "1/2 cup moist, plump raisins (dark or golden) or dried cranberries",
        "2 cups sugar",
        "1 cup canola or safflower oil",
        "4 large eggs",
        "8 ounces cream cheese, at room temperature (for frosting)",
        "1 stick (8 tablespoons) unsalted butter, at room temperature (for frosting)",
        "1 pound (3 3/4 cups) confectioners' sugar (for frosting)",
        "1 tablespoon fresh lemon juice or 1/2 teaspoon pure lemon extract (for frosting)",
        "1/2 cup shredded coconut, optional (for frosting)",
        "Toasted finely chopped nuts and/or toasted coconut, for topping, optional (for frosting"
      ],
      "instructions": {
        "stepOne": "For the cake: Position the racks to divide the oven into thirds and preheat the oven to 325 degrees. Butter and flour three 9-inch round, 2-inch deep cake pans, flour the insides and tap out the excess.",
        "stepTwo": "Whisk together the flour, cinnamon, baking powder, baking soda and salt and set aside. In another bowl, stir together the carrots, chopped nuts, coconut and raisins.",
        "stepThree": "Working in a mixer fitted with the paddle attachment, or in a large bowl with a whisk, beat the sugar and oil together until smooth. Add the eggs one by one and continue to beat until the batter is even smoother. If you are working in a mixer, reduce the speed to low, if you're working by hand switch to a large rubber spatula, and gently stir in the flour mixture — mix only until the dry ingredients disappear. Just as gently, stir in the chunky ingredients.",
        "stepFour": "Divide the batter among the baking pans and slide the pans into the oven. Bake the cakes for 40 to 50 minutes, rotating the pans top to bottom and front to back at the midway point. The cakes are properly baked when a knife inserted into the centers of the cakes comes out clean; the cakes will just start to come away from the edges. Transfer the pans to cooling racks, cool for 5 minutes, then turn out onto racks to cool to room temperature. (At this point, the cakes can be wrapped airtight and kept at room temperature overnight or frozen for up to 2 months; thaw before frosting.)",
        "stepFive": "For the frosting: Working in a mixer fitted with the paddle attachment, beat the cream cheese and butter together until smooth and creamy. Gradually add the confectioners' sugar and continue to beat until the frosting is velvety smooth. Beat in the lemon juice or extract.",
        "stepSix": "If you'd like to have coconut in the filling, scoop out about ½ of the frosting and stir the coconut into this portion.",
        "stepSeven": "To frost the cake, place one layer of the cake, right-side up, on a cardboard round or a cake plate. If you've added coconut to the frosting, use half of coconut frosting to generously cover the first layer. Use an offset spatula or a spoon to smooth the frosting all the way to the edges of the layer. Top with the second layer, this time placing the cake top-side down. Frost with the remainder of the coconut frosting. Top with the last layer, right-side up and use the plain frosting to cover the top — and the sides, if you want – of the cake. Finish the top layer with swirls of frosting. If you want to top the cake with toasted nuts or coconut, sprinkle on these ingredients now, while the frosting is soft. Slide the cake into the refrigerator for 15 minutes, just to set the frosting.",
        "stepEight": "Serving: The cake can be served as soon as the frosting is set. It can also wait, at room temperature and covered with a cake keeper, overnight. The cake is best served in thick slices at room temperature and, while it's good plain, it's better with whipped cream, vanilla ice cream or even some lemon curd with a little whipped cream folded in.",
        "stepNine": "Storing: Covered the cake will keep at room temperature for 2 to 3 days. It can also be frozen, uncovered, and then, when it is firmed, wrapped airtight and kept in the freezer for up to 2 months; defrost, still wrapped, in the refrigerator overnight."
      }
    },
    {
      "title": "Ginger Snaps",
      "chef": "Ellen Wells",
      "prepTime": 30,
      "cookTime": 30,
      "servingSize": 30,
      "ingredients": [
        "3/4 cup shortening, softened",
        "1 cup sugar",
        "1/4 cup molasses",
        "1 egg, beaten",
        "2 cups flour",
        "2 teaspoons baking soda",
        "1/4 teaspoon salt",
        "1 teaspoon cinnamon",
        "1 teaspoon cloves",
        "1 teaspoon ginger"
      ],
      "instructions": {
        "stepOne": "Cream shortening and sugar.",
        "stepTwo": "Add molasses and egg.",
        "stepThree": "Sift dry ingredients and add to creamed mixture.",
        "stepFour": "Roll into small balls and dip into sugar.",
        "stepFive": "Bake in the center of a preheated 350 degree oven for 12 minutes."
      }
    },
    {
      "title": "Cucumber Salad with Seaweed",
      "chef": "Neema Wandera",
      "prepTime": 10,
      "cookTime": 30,
      "servingSize": 2,
      "ingredients": [
        "Seaweed",
        "Salmon",
        "1-2 persian cucumbers",
        "1 1/2 avocados",
        "1/2 red onion",
        "Chili oil crisp",
        "Whipped cream cheese"
      ],
      "instructions": {
        "stepOne": "Cut salmon into small pieces. Season salmon as desired in large mixing bowl. Cook salmon on stove top and set aside.",
        "stepTwo": "Dice up cucumber, avocado, and onion. Mix whipped cream cheese, chili oil crisp, cucumber, avocado, and onion together. Add seasoning to taste.",
        "stepThree": "Add salmon to mixture. Scoop salad mix onto seaweed and enjoy!!!"
      }
    },
    {
      "title": "Bretts Bites Sandwich Cookies",
      "chef": "Jillian Moran",
      "prepTime": 40,
      "cookTime": 10,
      "servingSize": 20,
      "ingredients": [
        "1 cup soft butter",
        "1/2 cup whipping cream",
        "2 cups sifted flour",
        "1/4 cup soft butter (for filling)",
        "3/4 cup sifted powdered sugar (for filling)",
        "1 teaspoon vanilla (for filling)"
      ],
      "instructions": {
        "stepOne": "Mix together the ingredients for the cookies until fully combined and CHILL for at least two hours.",
        "stepTwo": "Once chilled, take 1/3 of the dough out at a time and roll it out on a surface lightly covered with flour until it's about 1 inch thick.",
        "stepThree": "Cut out circles of dough using a cookie cutter or something of that sort (shot glass, cap).",
        "stepFour": "Coat both sides of the circles in sugar (granulated or crystallized) and poke each circle 3-4 times with a fork.",
        "stepFive": "Bake on an ungreased baking sheet for 7-9 minutes at 375 degrees in the oven.",
        "stepSix": "Let cookies cool before frosting.",
        "stepSeven": "Mix the frosting ingredients adn put between two cookies and ENJOY!!! Can be eaten right away or stored in the fridge because we prefer them cold."
      }
    },
    {
      "title": "Molten Chocolate Cakes",
      "chef": "Vicky Lawrence",
      "prepTime": 20,
      "cookTime": 15,
      "servingSize": 6,
      "ingredients": [
        "4 squares Baker's Semi-Sweet Baking Chocolate",
        "1/2 cup butter",
        "1 cup powdered sugar",
        "2 eggs",
        "2 egg yolks",
        "6 tablespoons flour",
        "1/2 cup whipping cream or Cool Whip, thawed"
      ],
      "instructions": {
        "stepOne": "Preheat oven to 425 degrees. Butter 6 (1/2 cup) custard cups. Place on baking sheet.",
        "stepTwo": "Microwave chocolate and 1/2 cup butter in large microwavable bowl on high 1 minute or until butter is melted. Stir with wire whisk until chocolate is completely melted. Stir in sugar until well blended. Whisk in eggs and egg yolks. Stir in flour. Divide batter between prepared custard cups.",
        "stepThree": "Bake 13-14 minutes or until sides are firm but centers are soft. Let stand 1 minute. Carefully run small knife around cakes to loosen. Invert cakes onto dessert dishes. Optional: sprinkle confectioners sugar on top. Top with 1 tablespoon of whipping cream and serve immediately."
      }
    },
    {
      "title": "Sheet-Pan Chicken With Potatoes, Arugula and Garlic Yogurt",
      "chef": "Olivia Moran",
      "prepTime": 20,
      "cookTime": 45,
      "servingSize": 4,
      "ingredients": [
        "1 1/2 pounds chicken thighs and drumsticks",
        "1 1/4 pounds small Yukon Gold potatoes, halved and cut into 1/2 inch slices",
        "2 1/2 teaspoons kosher salt, more as needed",
        "1/2 teaspoon black pepper, more as needed",
        "2 tablespoons sriracha",
        "1/2 teaspoon ground cumin",
        "4 1/2 tablespoons extra-virgin olive oil, more as needed",
        "1/2 teaspoon lemon zest (from 1/2 lemon)",
        "1/3 cup greek yogurt",
        "1 small garlic clove",
        "2 oz. baby arugula",
        "Chopped fresh dill, as needed",
        "Lemon juice, as needed"
      ],
      "instructions": {
        "stepOne": "Combine chicken and potatoes in a large bowl. Season with salt and pepper. In a small bowl, whisk together sriracha, cumin and 3 tablespoons oil. Pour over chicken and potatoes and toss to combine. Let stand at room temperature for 30 minutes, or up to 8 hours in the refrigerator.",
        "stepTwo": "Heat oven to 425 degrees. Arrange chicken and potatoes on a large rimmed baking sheet in a single layer. Roast 15 minutes. Remove and toss potatoes lightly. Roast until chicken and potatoes are cooked through and everything is golden and slightly crisped, 25 to 30 minutes longer.",
        "stepThree": "While chicken cooks, place yogurt in a small bowl. Grate garlic over yogurt and season to taste with salt and pepper.",
        "stepFour": "To serve, spoon yogurt over chicken and vegetables in the pan. Scatter arugula and dill over mixture. Drizzle with oil and lemon juice and serve."
      }
    }
  ]
}
